ATang007ZH/DALI_SD16WU/FS/Setup/FS_MMC_HW_CM_GD32F450_GD_GD32450i_EVAL.c
/*********************************************************************
*                   (c) SEGGER Microcontroller GmbH                  *
*                        The Embedded Experts                        *
*                           www.segger.com                           *
**********************************************************************

-------------------------- END-OF-HEADER -----------------------------

File    : FS_MMC_HW_CM_GD32F450_GD_GD32450i_EVAL.c
Purpose : Hardware layer for MMC/SD driver in card mode
          for the GigaDevice GD32450i-EVAL evaluation board.
Literature:
  [1] Datasheet GD32F450xx ARM Cortex-M4 32-bit MCU
    (\\FILESERVER\Techinfo\Company\GigaDevice\MCUs\GD32F4\GD32F450xx_Datasheet_Rev1.1.pdf)
  [2] User manual GD32F4xx ARM Cortex-M4 32-bit MCU for GD32F405xx, GD32F407xx and GD32F450xx
    (\\FILESERVER\Techinfo\Company\GigaDevice\MCUs\GD32F4\GD32F4xx_User_Manual_Rev2.6.pdf)
  [3] User Manual GD32450I-EVAL
    (\\FILESERVER\Techinfo\Company\GigaDevice\MCUs\GD32F4\EvalBoard\GD32450I-EVAL\GD32450I-EVAL_User_Manual-V1.0.pdf)
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_MMC_HW_CM_SDIO_CLK
  #define FS_MMC_HW_CM_SDIO_CLK             48000     // Clock of MMC module in kHz
#endif

#ifndef   FS_MMC_HW_CM_MAX_SD_CLK
  #define FS_MMC_HW_CM_MAX_SD_CLK           48000     // Maximum transfer speed
#endif

#ifndef   FS_MMC_HW_CM_USE_OS
  #define FS_MMC_HW_CM_USE_OS               0         // Selects the operating mode: 1 - event-driven, 0 - polling
#endif

#ifndef   FS_MMC_HW_CM_POWER_GOOD_DELAY
  #define FS_MMC_HW_CM_POWER_GOOD_DELAY     50        // Number of  milliseconds to wait for the power supply of SD card to become ready
#endif

#ifndef   FS_MMC_HW_CM_ALIGNED_DMA_BURSTS
  #define FS_MMC_HW_CM_ALIGNED_DMA_BURSTS   0         // When set to 1 the DMA burst is aligned to the address and the number of bytes to be transferred.
#endif

#ifndef   FS_MMC_HW_CM_DIV_SD_CLK
  #define FS_MMC_HW_CM_DIV_SD_CLK           0         // Can be used to avoid underrun/overrun errors by slowing down the SD clock.
                                                      // This value is added to the current SD clock divider (SDIO_CLKCR.CLKDIV)
#endif

#ifndef   FS_MMC_HW_CM_CYCLES_PER_1MS
  #define FS_MMC_HW_CM_CYCLES_PER_1MS       30000     // Number of software cycles required to generate a 1ms delay
#endif

#ifndef   FS_MMC_HW_CM_HCLK
  #define FS_MMC_HW_CM_HCLK                 200000000
#endif

#ifndef   FS_MMC_HW_CM_PCLK2
  #define FS_MMC_HW_CM_PCLK2                (FS_MMC_HW_CM_HCLK / 2)
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_MMC_HW_CM_USE_OS
  #include "RTOS.h"
  #include "FS_OS.h"
  #include "gd32f4xx.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       SDIO interface registers
*/
#define SDIO_BASE_ADDR          0x40012C00uL
#define SDIO_POWER              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x00))
#define SDIO_CLKCR              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x04))
#define SDIO_ARG                (*(volatile U32 *)(SDIO_BASE_ADDR + 0x08))
#define SDIO_CMD                (*(volatile U32 *)(SDIO_BASE_ADDR + 0x0C))
#define SDIO_RESPCMD            (*(volatile U32 *)(SDIO_BASE_ADDR + 0x10))
#define SDIO_RESP1              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x14))
#define SDIO_RESP2              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x18))
#define SDIO_RESP3              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x1C))
#define SDIO_RESP4              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x20))
#define SDIO_DTIMER             (*(volatile U32 *)(SDIO_BASE_ADDR + 0x24))
#define SDIO_DLEN               (*(volatile U32 *)(SDIO_BASE_ADDR + 0x28))
#define SDIO_DCTRL              (*(volatile U32 *)(SDIO_BASE_ADDR + 0x2C))
#define SDIO_DCOUNT             (*(volatile U32 *)(SDIO_BASE_ADDR + 0x30))
#define SDIO_STA                (*(volatile U32 *)(SDIO_BASE_ADDR + 0x34))
#define SDIO_ICR                (*(volatile U32 *)(SDIO_BASE_ADDR + 0x38))
#define SDIO_MASK               (*(volatile U32 *)(SDIO_BASE_ADDR + 0x3C))
#define SDIO_FIFOCNT            (*(volatile U32 *)(SDIO_BASE_ADDR + 0x48))
#define SDIO_FIFO               (*(volatile U32 *)(SDIO_BASE_ADDR + 0x80))

/*********************************************************************
*
*       Reset and clock unit registers
*/
#define RCU_BASE_ADDR           0x40023800uL
#define RCU_AHB1RSTR            (*(volatile U32 *)(RCU_BASE_ADDR + 0x10))
#define RCU_APB2RSTR            (*(volatile U32 *)(RCU_BASE_ADDR + 0x24))
#define RCU_AHB1ENR             (*(volatile U32 *)(RCU_BASE_ADDR + 0x30))
#define RCU_APB2ENR             (*(volatile U32 *)(RCU_BASE_ADDR + 0x44))

/*********************************************************************
*
*       Port C registers
*/
#define GPIOC_BASE_ADDR         0x40020800uL
#define GPIOC_MODER             (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x00))
#define GPIOC_OTYPER            (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x04))
#define GPIOC_OSPEEDR           (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x08))
#define GPIOC_PUPDR             (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x0C))
#define GPIOC_IDR               (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x10))
#define GPIOC_AFRL              (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x20))
#define GPIOC_AFRH              (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port D registers
*/
#define GPIOD_BASE_ADDR         0x40020C00uL
#define GPIOD_MODER             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x00))
#define GPIOD_OTYPER            (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x04))
#define GPIOD_OSPEEDR           (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x08))
#define GPIOD_PUPDR             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x0C))
#define GPIOD_AFRL              (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x20))

/*********************************************************************
*
*       DMA 2 registers
*/
#define DMA2_BASE_ADDR          0x40026400uL
#define DMA2_LISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 0))
#define DMA2_HISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 4))
#define DMA2_LIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 8))
#define DMA2_HIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 12))
#define DMA2_S3CR               (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 16))
#define DMA2_S3NDTR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 20))
#define DMA2_S3PAR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 24))
#define DMA2_S3M0AR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 28))
#define DMA2_S3FCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 36))

/*********************************************************************
*
*       Reset and clock bits for the peripherals used by the driver
*/
#define AHB1ENR_DMA2EN          (1uL << 22)
#define AHB1ENR_PORTCEN         (1uL << 2)
#define AHB1ENR_PORTDEN         (1uL << 3)
#define APB2ENR_SDIOEN          (1uL << 11)
#define AHB1RSTR_DMA2RST        (1uL << 22)
#define APB2RSTR_SDIORST        (1uL << 11)

/*********************************************************************
*
*       SDIO status register
*/
#define STA_CCRCFAIL            (1uL << 0)
#define STA_DCRCFAIL            (1uL << 1)
#define STA_CTIMEOUT            (1uL << 2)
#define STA_DTIMEOUT            (1uL << 3)
#define STA_TXUNDERR            (1uL << 4)
#define STA_RXOVERR             (1uL << 5)
#define STA_CMDREND             (1uL << 6)
#define STA_CMDSENT             (1uL << 7)
#define STA_DATAEND             (1uL << 8)
#define STA_STBITERR            (1uL << 9)
#define STA_DBCKEND             (1uL << 10)
#define STA_CMDACT              (1uL << 11)
#define STA_TXACT               (1uL << 12)
#define STA_RXACT               (1uL << 13)

/*********************************************************************
*
*       SDIO data control register
*/
#define DCTRL_DTEN              (1uL << 0)
#define DCTRL_DTDIR             (1uL << 1)
#define DCTRL_DTMODE            (1uL << 2)
#define DCTRL_DMAEN             (1uL << 3)
#define DCTRL_DBLOCKSIZE_SHIFT  4uL

/*********************************************************************
*
*       SDIO clock control register
*/
#define CLKCR_CLKEN             (1uL   << 8)
#define CLKCR_CLK_PWRSAV        (0x1uL <<  9)
#define CLKCR_CLK_BYPASS        (0x1uL << 10)
#define CLKCR_WIDBUS_MASK       (0x3uL << 11)
#define CLKCR_WIDBUS_4BIT       (0x1uL << 11)
#define CLKCR_WIDBUS_8BIT       (0x2uL << 11)
#define CLKCR_HWFC_EN           (1UL   << 14)

/*********************************************************************
*
*       SDIO command register
*/
#define CMD_CMD_MASK            (0x3FuL)
#define CMD_WAITRESP_SHORT      (1uL << 6)
#define CMD_WAITRESP_LONG       (3uL << 6)
#define CMD_CPSMEN              (1uL << 10)
#define CMD_ENDCMDCMPLT         (1uL << 12)
#define CMD_NIEN                (1uL << 13)
#define CMD_WAITPEND            (1uL <<  9)

/*********************************************************************
*
*       SDIO interrupt control register
*/
#define ICR_CCRCFAIL            (1uL << 0)
#define ICR_DCRCFAIL            (1uL << 1)
#define ICR_CTIMEOUT            (1uL << 2)
#define ICR_DTIMEOUT            (1uL << 3)
#define ICR_TXUNDERR            (1uL << 4)
#define ICR_RXOVERR             (1uL << 5)
#define ICR_CMDREND             (1uL << 6)
#define ICR_CMDSENT             (1uL << 7)
#define ICR_DATAEND             (1uL << 8)
#define ICR_STBITERR            (1uL << 9)
#define ICR_DBCKEND             (1uL << 10)
#define ICR_SDIOIT              (1uL << 22)
#define ICR_CEATAEND            (1uL << 23)
#define ICR_MASK_STATIC         (ICR_CCRCFAIL | \
                                 ICR_DCRCFAIL | \
                                 ICR_CTIMEOUT | \
                                 ICR_DTIMEOUT | \
                                 ICR_TXUNDERR | \
                                 ICR_RXOVERR  | \
                                 ICR_CMDREND  | \
                                 ICR_CMDSENT  | \
                                 ICR_DATAEND  | \
                                 ICR_STBITERR | \
                                 ICR_DBCKEND  | \
                                 ICR_SDIOIT   | \
                                 ICR_CEATAEND)

/*********************************************************************
*
*       SDIO interrupt mask register
*/
#define MASK_CCRCFAILIE         (1uL << 0)
#define MASK_DCRCFAILIE         (1uL << 1)
#define MASK_CTIMEOUTIE         (1uL << 2)
#define MASK_DTIMEOUTIE         (1uL << 3)
#define MASK_TXUNDERRIE         (1uL << 4)
#define MASK_RXOVERRIE          (1uL << 5)
#define MASK_CMDRENDIE          (1uL << 6)
#define MASK_CMDSENTIE          (1uL << 7)
#define MASK_DATAENDIE          (1uL << 8)
#define MASK_STBITERRIE         (1uL << 9)
#define MASK_DBCKENDIE          (1uL <<10)
#define MASK_ALL                (MASK_CCRCFAILIE | \
                                 MASK_DCRCFAILIE | \
                                 MASK_CTIMEOUTIE | \
                                 MASK_DTIMEOUTIE | \
                                 MASK_TXUNDERRIE | \
                                 MASK_RXOVERRIE  | \
                                 MASK_CMDRENDIE  | \
                                 MASK_CMDSENTIE  | \
                                 MASK_DATAENDIE  | \
                                 MASK_STBITERRIE | \
                                 MASK_DBCKENDIE)

/*********************************************************************
*
*       SDIO data length register
*/
#define DLEN_DATALENGTH_MASK    (0x03FFFFFFuL)

/*********************************************************************
*
*       GPIO bit positions of SD card lines
*
*/
#define SD_D0_BIT               8     // Port C
#define SD_D1_BIT               9     // Port C
#define SD_D2_BIT               10    // Port C
#define SD_D3_BIT               11    // Port C
#define SD_CLK_BIT              12    // Port C
#define SD_CMD_BIT              2     // Port D

/*********************************************************************
*
*       DMA2 related defines
*/
#define LIFCR_CFEIF3            (1uL << 22)
#define LIFCR_CDMEIF3           (1uL << 24)
#define LIFCR_CTCIF3            (1uL << 25)
#define LIFCR_CHTIF3            (1uL << 26)
#define LIFCR_CTEIF3            (1uL << 27)
#define LISR_FEIF3              (1uL << 22)
#define LISR_TEIF3              (1uL << 25)
#define LISR_TCIF3              (1uL << 27)
#define S3CR_EN                 (1uL << 0)
#define S3CR_TEIE               (1uL << 2)
#define S3CR_TCIE               (1uL << 4)
#define S3CR_DIR_MASK           (3uL << 6)
#define S3CR_DIR_M2P            (1uL << 6)
#define S3CR_MINC               (1uL << 10)
#define S3CR_PSIZE_32BIT        (2uL << 11)
#define S3CR_MSIZE_32BIT        (2uL << 13)
#define S3CR_PRIO_HIGH          (3uL << 16)
#define S3CR_CHSEL_CH4          (4uL << 25)
#define S3CR_PFCTRL             (1uL << 5)
#define S3CR_PBURST_INCR4       (1uL << 21)
#define S3CR_MBURST_INCR4       (1uL << 23)
#define S3CR_MBURST_NONE        (0uL << 23)
#define S3CR_MBURST_MASK        (3uL << 23)
#define S3FCR_DMDIS             (1uL << 2)
#define S3FCR_FTH_FULL          (3uL << 0)

/*********************************************************************
*
*       Misc. defines
*/
#define PERIPHERAL_TO_MEMORY    0
#define MEMORY_TO_PERIPHERAL    1
#define DMA_MAX_NUM_TRANSFERS   65535
#define MAX_BLOCK_SIZE          512     // Maximum number of bytes in a transferred data block
#define MAX_NUM_BLOCKS          ((DMA_MAX_NUM_TRANSFERS * 4) / MAX_BLOCK_SIZE)  // DMA transfers 4 bytes at once
#define WAIT_TIMEOUT_MS         1000
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * FS_MMC_HW_CM_CYCLES_PER_1MS)
#define SDIO_PRIO               15
#define DMA_PRIO                15

/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
static U8               _IgnoreCRC;
static U16              _BlockSize;
static U16              _NumBlocks;
static U32              _DataBlockSize;
static void           * _pBuffer;
static U32              _NumLoopsWriteRegDelay;
static U8               _IsR1Busy;
#if FS_MMC_HW_CM_USE_OS
  static volatile U32   _StatusSDIO;
  static volatile U32   _StatusDMA;
#endif
#if FS_MMC_HW_CM_DIV_SD_CLK
  static U32            _RegValueCLKCR;
#endif
#if (FS_VERSION > 40405)
  static U8             _RepeatSame;
#endif

/*********************************************************************
*
*       Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _ld
*/
static unsigned _ld(U32 Value) {
  unsigned i;

  for (i = 0; i < 16u; i++) {
    if ((1uL << i) == Value) {
      break;
    }
  }
  return i;
}

/*********************************************************************
*
*       _Delay1ms
*
*  Function description
*    Blocks the program execution for about 1ms.
*    The number of loops must be adjusted according to the CPU speed.
*/
static void _Delay1ms(void) {
#if FS_MMC_HW_CM_USE_OS
  OS_Delay(1);
#else
  volatile unsigned NumLoops;

  NumLoops = FS_MMC_HW_CM_CYCLES_PER_1MS;
  do {
    ;
  } while (--NumLoops != 0u);
#endif
}

#if FS_MMC_HW_CM_DIV_SD_CLK

/*********************************************************************
*
*       _IsIntRAM
*
*  Function description
*    Checks if the address is located into internal RAM.
*/
static int _IsIntRAM(U32 Addr) {
  if ((Addr >= 0x20000000uL) && (Addr < 0x40000000uL)) {
    return 1;
  }
  return 0;
}

#endif  // FS_MMC_HW_CM_DIV_SD_CLK

/*********************************************************************
*
*       _StartDMATransfer
*/
static void _StartDMATransfer(U32 * pMemory, U32 * pPripheral, U8 Direction, U32 NumBytes) {
  FS_USE_PARA(NumBytes);
  DMA2_S3CR   &= ~S3CR_EN;          // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_S3PAR  = (U32)pPripheral;    // Periphery data register address
  DMA2_S3M0AR = (U32)pMemory;       // Memory buffer address
  DMA2_S3NDTR = 0;
  DMA2_LIFCR  = LIFCR_CDMEIF3       // Clear any pending interrupts.
              | LIFCR_CTEIF3
              | LIFCR_CHTIF3
              | LIFCR_CTCIF3
              | LIFCR_CFEIF3
              ;
  DMA2_S3CR   &= ~S3CR_DIR_MASK;
#if FS_MMC_HW_CM_USE_OS
  DMA2_S3CR   |= S3CR_TEIE
              |  S3CR_TCIE
              ;
  _StatusDMA  = 0;
#endif
  if (Direction == MEMORY_TO_PERIPHERAL) {
    DMA2_S3CR |= S3CR_DIR_M2P;
  }
  //
  // Set the correct burst size based on the number of bytes transferred.
  //
  DMA2_S3CR   &= ~S3CR_MBURST_MASK;
  if ((NumBytes & 0xFFuL) == 0) {
    DMA2_S3CR |= 0
              | S3CR_PBURST_INCR4   // Burst transfer on peripheral side
              | S3CR_MBURST_INCR4   // Burst transfer on memory side
              ;
  }
#if FS_MMC_HW_CM_ALIGNED_DMA_BURSTS
  //
  // The memory address must be aligned to burst size.
  // If this is not the case use single transfers.
  //
  DMA2_S3CR   &= ~S3CR_MBURST_MASK;
  if (((U32)pMemory & 0xFuL)  == 0 &&   // Can DMA perform bursts of 16 bytes?
      ((NumBytes    & 0xFFuL) == 0)) {
    DMA2_S3CR |= S3CR_MBURST_INCR4;
  } else {
    DMA2_S3CR |= S3CR_MBURST_NONE;
  }
#endif // FS_MMC_HW_CM_ALIGNED_DMA_BURSTS
#if FS_MMC_HW_CM_DIV_SD_CLK
  _RegValueCLKCR = 0;
  if (_IsIntRAM((U32)pMemory) == 0) {
    U32 v;

    //
    // Slow down the SD clock if external RAM or internal flash is accessed
    // in order to prevent DMA FIFO overrun/underrun errors.
    //
    v = SDIO_CLKCR;
    _RegValueCLKCR = v;
    v &= ~CLKCR_CLK_BYPASS;
    v += FS_MMC_HW_CM_DIV_SD_CLK;
    SDIO_CLKCR = v;
  }
#endif  // FS_MMC_HW_CM_DIV_SD_CLK
#if (FS_VERSION > 40405)
  if (_RepeatSame) {
    DMA2_S3CR &= ~S3CR_MINC;      // Do not increment memory pointer when filling with the same 32-bit value.
  } else {
    DMA2_S3CR |=  S3CR_MINC;      // Increment the memory pointer when writing entire blocks.
  }
#endif // FS_VERSION > 40405
  DMA2_S3CR   |= S3CR_EN;               // Start the data transfer
}

#if FS_MMC_HW_CM_USE_OS

/**********************************************************
*
*       SDIO_IRQHandler
*
*   Function description
*     Handles the SDIO interrupt.
*/
void SDIO_IRQHandler(void);
void SDIO_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();                        // Inform embOS that interrupt code is running.
  Status       = SDIO_STA;
  //
  // Save the status to a static variable and check it in the task.
  //
  SDIO_ICR     = Status & ICR_MASK_STATIC;    // Clear the static flags to prevent further interrupts.
  _StatusSDIO &= ICR_MASK_STATIC;             // Clear the dynamic flags
  _StatusSDIO |= Status;
  FS_X_OS_Signal();                           // Wake up the task.
  OS_LeaveInterrupt();                        // Inform embOS that interrupt code is left.
}

/**********************************************************
*
*       DMA1_Channel3_IRQHandler
*
*   Function description
*     Handles the DMA interrupt.
*/
void DMA1_Channel3_IRQHandler(void);
void DMA1_Channel3_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();          // Inform embOS that interrupt code is running.
  Status      = DMA2_LISR;
  Status     &= 0               // Make sure that we clear only the flags assigned to the DMA stream we use.
             | LIFCR_CFEIF3
             | LIFCR_CDMEIF3
             | LIFCR_CTCIF3
             | LIFCR_CHTIF3
             | LIFCR_CTEIF3
             ;
  DMA2_LIFCR  = Status;         // Clear pending interrupt flags.
  _StatusDMA |= Status;         // Save the status to a static variable and check it in the task.
  FS_X_OS_Signal();             // Wake up the task.
  OS_LeaveInterrupt();          // Inform embOS that interrupt code is left.
}

#endif

/*********************************************************************
*
*       _WriteRegDelayed
*
*  Function description
*    Waits before writing to a register as specified in the datasheet:
*      "After a data write, data cannot be written to this register for three SDIOCLK
*      (48 MHz) clock periods plus two FS_MMC_HW_CM_PCLK2 clock periods."
*/
static void _WriteRegDelayed(volatile U32 * pAddr, U32 Value) {
  volatile U32 NumLoops;

  NumLoops  = _NumLoopsWriteRegDelay;
  do {
    ;
  } while (--NumLoops);
  *pAddr = Value;
}

/*********************************************************************
*
*       _WaitForInactive
*/
static void _WaitForInactive(void) {
  U32 Status;
  U32 v;
  U32 TimeOut;

