ATang007ZH/DALI_SD16WU/FS/Setup/FS_MMC_HW_CM_GD32F450_GD_GD32450i_EVAL.c
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = SDIO_STA;
    if (((Status & STA_CMDACT) == 0) &&
        ((Status & STA_TXACT)  == 0) &&
        ((Status & STA_RXACT)  == 0)) {
      if (_IsR1Busy == 0) {
        break;
      }
      //
      // The SDIO host controller is not able to handle R1 responses
      // with busy signaling therefore we have to check here the
      // level of the DAT0 line. The SD / MMC device drives the DAT0
      // line to LOW if busy.
      // The SD / MMC devices require to be clocked in order to release
      // the DAT0 line but the SDIO host controller is configured clock
      // the SD/ MMC device only when a command or data is transferred
      // (to prevent DMA issues). For this reason we have to temporarily
      // disable this mode so that the SDIO host controller
      // clocks the SD / MMC device while we are checking the status
      // of the DAT0 line.
      //
      if (GPIOC_IDR & (1uL << SD_D0_BIT)) {
        _IsR1Busy = 0;
        if ((SDIO_CLKCR & CLKCR_CLK_PWRSAV) == 0) {
          v = SDIO_CLKCR | CLKCR_CLK_PWRSAV;
          _WriteRegDelayed(&SDIO_CLKCR, v);
        }
        break;
      }
      if (SDIO_CLKCR & CLKCR_CLK_PWRSAV) {
        v = SDIO_CLKCR & ~CLKCR_CLK_PWRSAV;
        _WriteRegDelayed(&SDIO_CLKCR, v);
      }
    }
    if (--TimeOut == 0u) {
      break;
    }
  }
}

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    Initialize the SD / MMC host controller.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Notes
*     (1) Flow control should not be enabled as it causes glitches on the clock line (see [3])
*/
static void _HW_Init(U8 Unit) {
  unsigned ms;
  U32      Delay_ns;
  U32      Inst_ns;

  FS_USE_PARA(Unit);
  //
  // Reset SDIO
  //
  RCU_APB2RSTR |= APB2RSTR_SDIORST;
  RCU_APB2RSTR &= ~APB2RSTR_SDIORST;

  //
  // Enable GPIOs, DMA and SDIO
  //
  RCU_AHB1ENR |= AHB1ENR_DMA2EN
              |  AHB1ENR_PORTCEN
              |  AHB1ENR_PORTDEN
              ;
  RCU_APB2ENR |= APB2ENR_SDIOEN
              ;
  //
  // D0, D1, D2, D3, CLK lines are controlled by SDIO
  //
  GPIOC_MODER   &= ~((3uL << (SD_D0_BIT  << 1)) |
                     (3uL << (SD_D1_BIT  << 1)) |
                     (3uL << (SD_D2_BIT  << 1)) |
                     (3uL << (SD_D3_BIT  << 1)) |
                     (3uL << (SD_CLK_BIT << 1)));
  GPIOC_MODER   |=   (2uL << (SD_D0_BIT  << 1))
                |    (2uL << (SD_D1_BIT  << 1))
                |    (2uL << (SD_D2_BIT  << 1))
                |    (2uL << (SD_D3_BIT  << 1))
                |    (2uL << (SD_CLK_BIT << 1))
                ;
  GPIOC_OTYPER  &= ~((1uL <<  SD_D0_BIT) |
                     (1uL <<  SD_D1_BIT) |
                     (1uL <<  SD_D2_BIT) |
                     (1uL <<  SD_D3_BIT) |
                     (1uL <<  SD_CLK_BIT));
  GPIOC_PUPDR   &= ~((3uL << (SD_D0_BIT  << 1)) |
                     (3uL << (SD_D1_BIT  << 1)) |
                     (3uL << (SD_D2_BIT  << 1)) |
                     (3uL << (SD_D3_BIT  << 1)) |
                     (3uL << (SD_CLK_BIT << 1)));
  GPIOC_PUPDR   |=   (1uL << (SD_D0_BIT  << 1))   // The data transfer works reliably only if the pull-ups are enabled.
                |    (1uL << (SD_D1_BIT  << 1))
                |    (1uL << (SD_D2_BIT  << 1))
                |    (1uL << (SD_D3_BIT  << 1))
                |    (1uL << (SD_CLK_BIT << 1))
                ;
  GPIOC_AFRH    &= ~((0xFuL << ((SD_D0_BIT - 8)  << 2)) |
                     (0xFuL << ((SD_D1_BIT - 8) << 2))  |
                     (0xFuL << ((SD_D2_BIT - 8)  << 2)) |
                     (0xFuL << ((SD_D3_BIT - 8)  << 2)) |
                     (0xFuL << ((SD_CLK_BIT - 8) << 2)));
  GPIOC_AFRH    |=   (12uL  << ((SD_D0_BIT - 8)  << 2))
                |    (12uL  << ((SD_D1_BIT - 8)  << 2))
                |    (12uL  << ((SD_D2_BIT - 8)  << 2))
                |    (12uL  << ((SD_D3_BIT - 8)  << 2))
                |    (12uL  << ((SD_CLK_BIT - 8) << 2));
  GPIOC_OSPEEDR &= ~((3uL   << (SD_D0_BIT  << 1)) |
                     (3uL   << (SD_D1_BIT  << 1))  |
                     (3uL   << (SD_D2_BIT  << 1))  |
                     (3uL   << (SD_D3_BIT  << 1))  |
                     (3uL   << (SD_CLK_BIT << 1)));
  GPIOC_OSPEEDR |=   (3uL   << (SD_D0_BIT  << 1)) |
                     (3uL   << (SD_D1_BIT  << 1)) |
                     (3uL   << (SD_D2_BIT  << 1)) |
                     (3uL   << (SD_D3_BIT  << 1)) |
                     (3uL   << (SD_CLK_BIT << 1));
  //
  // CMD line is also controlled by SDIO
  //
  GPIOD_MODER   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_MODER   |=  (2uL   << (SD_CMD_BIT << 1));
  GPIOD_OTYPER  &= ~(1uL   <<  SD_CMD_BIT);
  GPIOD_PUPDR   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_PUPDR   |=   1uL   << (SD_CMD_BIT << 1);    // The data transfer works reliably only if the pull-ups are enabled.
  GPIOD_AFRL    &= ~(0xFuL << (SD_CMD_BIT << 2));
  GPIOD_AFRL    |=  (12uL  << (SD_CMD_BIT << 2));
  GPIOD_OSPEEDR &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_OSPEEDR |=  (3uL   << (SD_CMD_BIT << 1));
  //
  // SDIO uses the stream 3, channel 4 of DMA2
  //
  DMA2_S3CR   &= ~S3CR_EN;          // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_LIFCR  |= LIFCR_CDMEIF3      // Clear any pending interrupts.
              |  LIFCR_CTEIF3
              |  LIFCR_CHTIF3
              |  LIFCR_CTCIF3
              |  LIFCR_CFEIF3
              ;
  DMA2_S3CR   = 0
              | S3CR_PSIZE_32BIT    // Peripheral bus width
              | S3CR_MSIZE_32BIT    // Memory bus width
              | S3CR_MINC           // Memory increment enable
              | S3CR_PRIO_HIGH      // Set priority to high
              | S3CR_CHSEL_CH4      // Channel connected to SDIO
              | S3CR_PFCTRL         // Peripheral controls the data transfer
              ;
  DMA2_S3FCR  = 0
              | S3FCR_FTH_FULL      // Full FIFO
              | S3FCR_DMDIS         // Disable direct mode (the only way the DMA transfer works together with SDIO)
              ;
  //
  // Compute the number of software loops to delay before writing to some SDIO registers.
  //
  Delay_ns  = (1000000000uL + ((FS_MMC_HW_CM_SDIO_CLK * 3) - 1)) / (FS_MMC_HW_CM_SDIO_CLK * 3);
  Delay_ns += (1000000000uL + ((FS_MMC_HW_CM_PCLK2 * 2) - 1)) / (FS_MMC_HW_CM_PCLK2 * 2);
  Inst_ns   = (1000000000uL + (FS_MMC_HW_CM_HCLK - 1)) / FS_MMC_HW_CM_HCLK;
  _NumLoopsWriteRegDelay = Delay_ns / Inst_ns;
  //
  // Initialize SDIO
  //
  SDIO_POWER  = 0;                  // Power off
  SDIO_CLKCR  = 0;                  // Disable the clock (Note 1)
  SDIO_ARG    = 0;
  SDIO_CMD    = 0;
  SDIO_DTIMER = 0;
  SDIO_DLEN   = 0;
  SDIO_DCTRL  = 0;
  SDIO_ICR    = 0x00C007FF;         // Clear interrupts
  SDIO_MASK   = 0;
  _WriteRegDelayed(&SDIO_POWER, 3); // Make sure that SDIO_POWER is written after the specified delay.
#if FS_MMC_HW_CM_USE_OS
  //
  // Unmask the interrupt sources.
  //
  SDIO_MASK   = MASK_ALL;
  //
  // Set the priority and enable the interrupts.
  //
  NVIC_SetPriority(DMA1_Channel3_IRQn, DMA_PRIO);
  NVIC_SetPriority(SDIO_IRQn, SDIO_PRIO);
  NVIC_EnableIRQ(DMA1_Channel3_IRQn);
  NVIC_EnableIRQ(SDIO_IRQn);
#endif // FS_MMC_HW_CM_USE_OS
  //
  // Wait for the power supply of the SD card to stabilize.
  //
  ms = FS_MMC_HW_CM_POWER_GOOD_DELAY;
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    Blocks the code execution for the specified time.
*
*  Parameters
*    ms   Number of milliseconds to delay.
*/
static void _HW_Delay(int ms) {
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_IsPresent
*
*  Function description
*    Returns the state of the media.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    FS_MEDIA_STATE_UNKNOWN     The state of the storage device is not known.
*    FS_MEDIA_NOT_PRESENT       The storage device is not present.
*    FS_MEDIA_IS_PRESENT        The storage device is present.
*
*  Additional information
*    If the state is unknown, the function has to FS_MEDIA_STATE_UNKNOWN
*    and the higher layers of the file system will try to figure out
*    if a storage device is present or not.
*/
static int _HW_IsPresent(U8 Unit) {
  FS_USE_PARA(Unit);
  //
  // The card detect signal is not connected to the CPU on the evaluation board.
  //
  return FS_MEDIA_STATE_UNKNOWN;
}

/*********************************************************************
*
*       _HW_IsWriteProtected
*
*  Function description
*    Returns whether card is write protected or not.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    ==0      The SD / MMC card is writable.
*    ==1      The SD / MMC card is write protected.
*/
static int _HW_IsWriteProtected(U8 Unit) {
  FS_USE_PARA(Unit);
  return 0;
}

/*********************************************************************
*
*       _HW_SetMaxSpeed
*
*  Function description
*    Configures the frequency of the clock supplied to SD / MMC card.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    Freq     Requested clock frequency in kHz.
*
*  Return value
*    !=0  OK, actual configured clock frequency in kHz.
*    ==0  An error occurred.
*
*  Additional information
*    This function is called two times:
*    1. During card initialization
*       Initialize the frequency to not more than 400 kHz.
*    2. After card initialization
*       The CSD register of card is read and the max frequency
*       the card can operate is determined.
*       [In most cases: MMC cards 20 MHz, SD cards 25 MHz]
*    The configured clock frequency has to be smaller than or equal to
*    the frequency specified via Freq.
*
*  Notes
*    (1) Some IAR ARM versions will optimize out the multiplication of Fact & Freq.
*        This seems to affect all versions after 7.40. To be on the safe side the
*        optimization is disabled for all versions for now. The function is normally
*        only called twice during the initialization, therefor there is no performance penalty.
*/
#ifdef __ICCARM__
  #pragma optimize=none         // Note 1
#endif
static U16 _HW_SetMaxSpeed(U8 Unit, U16 Freq) {
  U32      Fact;
  unsigned Div;
  U32      ClkBypass;
  U32      v;

  FS_USE_PARA(Unit);
  if (Freq > FS_MMC_HW_CM_MAX_SD_CLK) {
    Freq = FS_MMC_HW_CM_MAX_SD_CLK;
  }
  _WaitForInactive();
  SDIO_CLKCR &= ~(CLKCR_CLKEN | 0xFFuL | CLKCR_CLK_BYPASS);
  Fact        = 2;
  Div         = 0;
  ClkBypass   = CLKCR_CLK_BYPASS;
  if (Freq < FS_MMC_HW_CM_SDIO_CLK) {
    ClkBypass = 0;
    while ((Freq * Fact) < FS_MMC_HW_CM_SDIO_CLK) {
      ++Fact;
      if (0xFF == ++Div) {
        break;
      }
    }
  }
  v = SDIO_CLKCR | Div | CLKCR_CLKEN | CLKCR_CLK_PWRSAV | ClkBypass;
  _WriteRegDelayed(&SDIO_CLKCR, v);
  Freq = FS_MMC_HW_CM_SDIO_CLK;
  if (ClkBypass == 0) {
    Freq /= (Div + 2);
  }
  return Freq;
}

/*********************************************************************
*
*       _HW_SetResponseTimeOut
*
*  Function description
*    Sets the maximum time the SD / MMC host controller
*    has to wait for a response.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    Value    Number of SD / MMC clock cycles.
*/
static void _HW_SetResponseTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  FS_USE_PARA(Value);
  //
  // The response timeout is fixed in hardware
  //
}

/*********************************************************************
*
*       _HW_SetReadDataTimeOut
*
*  Function description
*    Sets the maximum time the SD / MMC host controller has to wait
*    for the arrival of data.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    Value    Number of SD / MMC clock cycles.
*/
static void _HW_SetReadDataTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  SDIO_DTIMER = Value;
}

/*********************************************************************
*
*       _HW_SendCmd
*
*  Function description
*    Sends a command to the card.
*
*  Parameters
*    Unit           Index of the SD / MMC host controller (0-based).
*    Cmd            Command number according to [1]
*    CmdFlags       Additional information about the command to execute
*    ResponseType   Type of response as defined in [1]
*    Arg            Command parameter
*/
static void _HW_SendCmd(U8 Unit, unsigned Cmd, unsigned CmdFlags, unsigned ResponseType, U32 Arg) {
  U32 CmdCfg;
  U8  Direction;
  U32 NumBytes;
  U32 Status;
  U32 v;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif

  FS_USE_PARA(Unit);
  _WaitForInactive();
#if (FS_VERSION > 40405)
  _RepeatSame = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_WRITE_BURST_FILL) {
    _RepeatSame = 1;
  }
#endif
  _IsR1Busy = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_SETBUSY) {
    _IsR1Busy = 1;
  }
  CmdCfg = CMD_CPSMEN
         | CMD_ENDCMDCMPLT
         | CMD_NIEN
         ;
  _IgnoreCRC = 0;
  switch (ResponseType) {
  case FS_MMC_RESPONSE_FORMAT_R3:
    _IgnoreCRC = 1;
    //lint -fallthrough
  case FS_MMC_RESPONSE_FORMAT_R1:
    CmdCfg |= CMD_WAITRESP_SHORT;
    break;
  case FS_MMC_RESPONSE_FORMAT_R2:
    CmdCfg |= CMD_WAITRESP_LONG;
    break;
  default:
    break;
  }
  v  = SDIO_CLKCR;
  v &= ~CLKCR_WIDBUS_MASK;
  if (CmdFlags & FS_MMC_CMD_FLAG_USE_SD4MODE) {           // 4 bit mode?
    v |= CLKCR_WIDBUS_4BIT;
  } else {
    v &=~CLKCR_WIDBUS_MASK;
  }
  SDIO_CLKCR = v;
  v = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_DATATRANSFER) {
    SDIO_ICR = ICR_DCRCFAIL
             | ICR_DTIMEOUT
             | ICR_TXUNDERR
             | ICR_DATAEND
             | ICR_DBCKEND
             | ICR_STBITERR
             | ICR_RXOVERR
             ;
    NumBytes = _BlockSize * _NumBlocks;
    SDIO_DLEN = NumBytes;
    if (CmdFlags & FS_MMC_CMD_FLAG_WRITETRANSFER) {
      Direction = MEMORY_TO_PERIPHERAL;
    } else {
      Direction = PERIPHERAL_TO_MEMORY;
    }
    _StartDMATransfer((U32 *)_pBuffer, (U32 *)&SDIO_FIFO, Direction, NumBytes);
    if ((CmdFlags & FS_MMC_CMD_FLAG_WRITETRANSFER) == 0) {
      //
      // Data transfer starts when the data control register is updated.
      //
      v = 0u
        | _DataBlockSize
        | DCTRL_DTDIR
        | DCTRL_DMAEN
        | DCTRL_DTEN
        ;
    }
  }
  SDIO_DCTRL = v;
  //
  // Clear pending status flags
  //
  SDIO_ICR = ICR_CCRCFAIL
           | ICR_CTIMEOUT
           | ICR_CMDREND
           | ICR_CMDSENT
           ;
#if FS_MMC_HW_CM_USE_OS
  _StatusSDIO = 0;
#endif
  SDIO_ARG = Arg;
  SDIO_CMD = CmdCfg | (Cmd & CMD_CMD_MASK);
  if (CmdFlags & FS_MMC_CMD_FLAG_INITIALIZE)  {
#if (FS_MMC_HW_CM_USE_OS == 0)
    TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
    for (;;) {
#if FS_MMC_HW_CM_USE_OS
      Status = _StatusSDIO;
#else
      Status = SDIO_STA;
#endif
      if (Status & (STA_CMDSENT | STA_CMDREND | STA_CCRCFAIL |  STA_CTIMEOUT)) {
        break;
      }
#if FS_MMC_HW_CM_USE_OS
      {
        int r;

        r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
        if (r != 0) {
          break;
        }
      }
#else
      if (--TimeOut == 0u) {
        break;
      }
#endif
    }
  }
}

/*********************************************************************
*
*       _HW_GetResponse
*
*  Function description
*    Waits for a response to be received.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    pBuffer  User allocated buffer where the response is stored.
*    Size     Size of the buffer in bytes.
*
*  Return values
*    FS_MMC_CARD_NO_ERROR                 Success
*    FS_MMC_CARD_RESPONSE_CRC_ERROR       CRC error in response
*    FS_MMC_CARD_RESPONSE_TIMEOUT         No response received
*    FS_MMC_CARD_RESPONSE_GENERIC_ERROR   Any other error
*
*  Notes
*    (1) The response data has to be stored at byte offset 1 when
*        the SD host controller does not provide the first byte
*        of response message, that is the byte that includes the
*        start bit.
*/
static int _HW_GetResponse(U8 Unit, void * pBuffer, U32 Size) {
  U8           * p;
  int            NumBytes;
  volatile U32 * pReg;
  U32            Data32;
  U32            Status;
  U32            NumWords;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32            TimeOut;
#endif

  FS_USE_PARA(Unit);
  p        = (U8 *)pBuffer;
  NumBytes = (int)Size;
#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    Status = _StatusSDIO;
#else
    Status = SDIO_STA;
#endif
    if ((Status & (STA_CMDSENT | STA_CMDREND | STA_CCRCFAIL | STA_CTIMEOUT)) != 0u) {
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    {
      int r;

      r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
      if (r != 0) {
        return FS_MMC_CARD_RESPONSE_TIMEOUT;
      }
    }
#else
    if (--TimeOut == 0u) {
      return FS_MMC_CARD_RESPONSE_TIMEOUT;
    }
#endif
  }
  if ((STA_CTIMEOUT & Status) != 0u) {
    return FS_MMC_CARD_RESPONSE_TIMEOUT;
  }
  if (((STA_CCRCFAIL & Status) != 0u) && (_IgnoreCRC == 0u)) {
    return FS_MMC_CARD_READ_CRC_ERROR;
  }
  if (((STA_CMDREND & Status) != 0u) || (_IgnoreCRC != 0u)) {
    *p++ = (U8)SDIO_RESPCMD;
    NumBytes--;
    pReg = (volatile U32 *)(&SDIO_RESP1);
    NumWords = (U32)NumBytes >> 2;
    if (NumWords != 0u) {
      do {
        Data32 = *pReg++;
        *p++ = (U8)(Data32 >> 24);
        *p++ = (U8)(Data32 >> 16);
        *p++ = (U8)(Data32 >> 8);
        *p++ = (U8)Data32;
        NumBytes -= 4u;
      } while (--NumWords);
    }
    if (NumBytes == 3u) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
      *p++ = (U8)(Data32 >> 16);
      *p++ = (U8)(Data32 >> 8);
    }
    if (NumBytes == 2u) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
      *p++ = (U8)(Data32 >> 16);
    }
    if (NumBytes == 1u) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
    }
  }
  return FS_MMC_CARD_NO_ERROR;
}

/*********************************************************************
*
*       _HW_ReadData
*
*  Function description
*    Reads data from the card using the SD / MMC host controller.
*
*  Parameters
*    Unit       Index of the SD / MMC host controller (0-based).
*    pBuffer    [OUT] Data received from storage device.
*    NumBytes   Number of bytes in one read data block.
*    NumBlocks  Number of data blocks to be read.
*
*  Return values
*    FS_MMC_CARD_NO_ERROR             Success
*    FS_MMC_CARD_READ_CRC_ERROR       CRC error in received data
*    FS_MMC_CARD_READ_TIMEOUT         No data received
*    FS_MMC_CARD_READ_GENERIC_ERROR   Any other error
*
*  Additional information
*    The total number of bytes to be transferred is NumBytes * NumBlocks.
*
*  Notes
*    (1) The DMA FIFO error flag (DMA2_LISR.FEIF3) is not checked
*        in this function. This flag does not necessarily indicate an error.
*        When the DMA is not able to transfer the data fast enough,
*        the SDIO_STA.RXOVERR will be set by SDIO peripheral.
*/
static int _HW_ReadData(U8 Unit, void * pBuffer, unsigned NumBytes, unsigned NumBlocks) {
  U32 StatusSDIO;
  U32 StatusDMA;
  int r;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif

  FS_USE_PARA(Unit);
  FS_USE_PARA(pBuffer);
  FS_USE_PARA(NumBytes);
  FS_USE_PARA(NumBlocks);
#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDIO_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if ((StatusDMA & LISR_TEIF3) != 0u) {
      //
      // This error is typically reported if pBuffer points to a buffer located
      // in the core coupled memory (base address: 0x1000_0000).
      // The core coupled memory is not accessible to DMA.
      //
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_DCRCFAIL) != 0u) {
      r = FS_MMC_CARD_READ_CRC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_DTIMEOUT) != 0u) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if ((StatusSDIO & STA_RXOVERR) != 0u) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_STBITERR) != 0u) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if ((StatusDMA & LISR_TCIF3) != 0u) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
#else
    if (--TimeOut == 0u) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
#endif
  }
  //
  // In case of an error, disable DMA and the data state machine in SDIO.
  //
  if (r != 0) {
    DMA2_S3CR &= ~S3CR_EN;                    // Stop the data transfer
    while ((DMA2_S3CR & S3CR_EN) != 0u) {     // Wait for the stream to switch off
      ;
    }
    SDIO_DCTRL &= ~DCTRL_DTEN;                // Cancel SDIO data transfer.
  }
#if FS_MMC_HW_CM_DIV_SD_CLK
  //
  // Restore the SD clock speed.
  //
  if (_RegValueCLKCR != 0u) {
    SDIO_CLKCR = _RegValueCLKCR;
  }
#endif  // FS_MMC_HW_CM_DIV_SD_CLK
  return r;
}

/*********************************************************************
*
*       _HW_WriteData
*
*  Function description
*    Writes the data to SD / MMC card using the SD / MMC host controller.
*
*  Parameters
*    Unit       Index of the SD / MMC host controller (0-based).
*    pBuffer    [OUT] Data to be sent to storage device.
*    NumBytes   Number of bytes in one written data block.
*    NumBlocks  Number of data blocks to be written.
*
*  Return values
*    FS_MMC_CARD_NO_ERROR      Success
*    FS_MMC_CARD_READ_TIMEOUT  No data received
*
*  Additional information
*    The total number of bytes to be transferred is NumBytes * NumBlocks.
*
*  Notes
*    (1) The DMA FIFO error flag (DMA2_LISR.FEIF3) is not checked
*        in this function. This flag does not necessarily indicate an error.
*        When the DMA is not able to transfer the data fast enough,
*        the SDIO_STA.TXUNDERR will be set by SDIO peripheral.
*/
static int _HW_WriteData(U8 Unit, const void * pBuffer, unsigned NumBytes, unsigned NumBlocks) {
  U32 StatusSDIO;
  U32 StatusDMA;
  int r;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif

