ATang007ZH/DALI_SD16WU/FS/Setup/FS_MMC_HW_CM_GD32F450_GD_GD32450i_EVAL.c
  FS_USE_PARA(Unit);
  FS_USE_PARA(pBuffer);
  FS_USE_PARA(NumBytes);
  FS_USE_PARA(NumBlocks);
#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  //
  // Data transfer starts when the data control register is updated.
  //
  SDIO_DCTRL = 0u
             | _DataBlockSize
             | DCTRL_DTEN
             | DCTRL_DMAEN
             ;
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDIO_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if ((StatusDMA & LISR_TEIF3) != 0u) {
      //
      // This error is typically reported if pBuffer points to a buffer located
      // in the core coupled memory (base address: 0x1000_0000).
      // The core coupled memory is not accessible to DMA.
      //
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_DCRCFAIL) != 0u) {
      r = FS_MMC_CARD_WRITE_CRC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_DTIMEOUT) != 0u) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_TXUNDERR) != 0u) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_STBITERR) != 0u) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if ((StatusSDIO & STA_DATAEND) != 0u) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
#else
    if (--TimeOut == 0u) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
#endif
  }
  //
  // In case of an error, disable DMA and the data state machine in SDIO.
  //
  if (r != 0) {
    DMA2_S3CR &= ~S3CR_EN;                    // Stop the data transfer
    while ((DMA2_S3CR & S3CR_EN) != 0u) {     // Wait for the stream to switch off
      ;
    }
    SDIO_DCTRL &= ~DCTRL_DTEN;                // Cancel SDIO data transfer.
  }
#if FS_MMC_HW_CM_DIV_SD_CLK
  //
  // Restore the SD clock speed.
  //
  if (_RegValueCLKCR != 0u) {
    SDIO_CLKCR = _RegValueCLKCR;
  }
#endif  // FS_MMC_HW_CM_DIV_SD_CLK
  return r;
}

/*********************************************************************
*
*       _HW_SetDataPointer
*
*  Function description
*    Tells the hardware layer where to read data from
*    or write data to.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    p        Data buffer.
*
*  Additional information
*    This function is optional. It is required to be implemented for
*    some SD / MMC host controllers that need to know the address of
*    the data before sending the command to the card,
*    eg. when transferring the data via DMA.
*/
static void _HW_SetDataPointer(U8 Unit, const void * p) {
  FS_USE_PARA(Unit);
  _pBuffer = (void *)p; // cast const away as this buffer is used also for storing the data from card
}

/*********************************************************************
*
*       _HW_SetBlockLen
*
*  Function description
*    Sets the block size (sector size) that has to be transferred.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*/
static void _HW_SetBlockLen(U8 Unit, U16 BlockSize) {
  FS_USE_PARA(Unit);
  _BlockSize     = BlockSize;
  _DataBlockSize = _ld(BlockSize) << DCTRL_DBLOCKSIZE_SHIFT;
}

/*********************************************************************
*
*       _HW_SetNumBlocks
*
*  Function description
*    Sets the number of blocks (sectors) to be transferred.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*/
static void _HW_SetNumBlocks(U8 Unit, U16 NumBlocks) {
  FS_USE_PARA(Unit);
  _NumBlocks = NumBlocks;
}

/*********************************************************************
*
*       _HW_GetMaxReadBurst
*
*  Function description
*    Returns the number of block (sectors) that can be read at once
*    with a single READ_MULTIPLE_SECTOR command.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be read at once.
*/
static U16 _HW_GetMaxReadBurst(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

/*********************************************************************
*
*       _HW_GetMaxWriteBurst
*
*  Function description
*    Returns the number of block (sectors) that can be written at once
*    with a single WRITE_MULTIPLE_SECTOR command.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be written at once.
*/
static U16 _HW_GetMaxWriteBurst(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

#if (FS_VERSION > 40405)

  /*********************************************************************
*
*       _HW_GetMaxWriteBurstFill
*
*  Function description
*    Returns the number of block (sectors) that can be written at once
*    with a single WRITE_MULTIPLE_SECTOR command. The contents of the
*    sectors is filled with the same 32-bit pattern.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be written at once. The function has
*    to return 0 if the feature is not supported.
*/
static U16 _HW_GetMaxWriteBurstFill(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

#endif

/*********************************************************************
*
*       Public data
*
**********************************************************************
*/
const FS_MMC_HW_TYPE_CM FS_MMC_HW_CM_GD32F450_GD_GD32450i_EVAL = {
  _HW_Init,
  _HW_Delay,
  _HW_IsPresent,
  _HW_IsWriteProtected,
  _HW_SetMaxSpeed,
  _HW_SetResponseTimeOut,
  _HW_SetReadDataTimeOut,
  _HW_SendCmd,
  _HW_GetResponse,
  _HW_ReadData,
  _HW_WriteData,
  _HW_SetDataPointer,
  _HW_SetBlockLen,
  _HW_SetNumBlocks,
  _HW_GetMaxReadBurst,
  _HW_GetMaxWriteBurst
#if (FS_VERSION > 40405)
  , NULL
  , _HW_GetMaxWriteBurstFill
#endif
#if (FS_VERSION > 50200)
  , NULL
  , NULL
  , NULL
  , NULL
  , NULL
  , NULL
  , NULL
#endif
};

/*************************** End of file ****************************/

